
&НаКлиенте
Процедура СканированиеШтрихкодов(Команда)                                                                     
	
	ОткрытьФорму("Обработка.МТСД_Тест.Форма.СканированиеШтрихкодов");
		
КонецПроцедуры

&НаКлиенте
Процедура ФотоВидео(Команда)
	
	ОткрытьФорму("Обработка.МТСД_Тест.Форма.ФотоВидео");
	
КонецПроцедуры

&НаКлиенте
Процедура ТестОтладки(Команда)
	
	#Если МобильныйКлиент Тогда
	УстановитьИспользуемыйСервер(ИспользуемыйСервер.Автономный);
	ТестОтладкиНаСервере();
	
	УстановитьИспользуемыйСервер(ИспользуемыйСервер.Основной);
	ТестОтладкиНаСервере();
	#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ТестОтладкиНаСервере()
	
	А = 5;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложенияМобильногоУстройства(Команда)
	
	ОткрытьФорму("Обработка.МТСД_Тест.Форма.ЗапускПриложенияМобильногоУстройства");
	
КонецПроцедуры

