
#Если МобильныйКлиент Тогда    

#Область ПрограммныйИнтерфейс

Процедура ПолучитьОбъектНаМТСД(ИмяМенеджераОбъекта, ПараметрыПолученияОбъекта, ОписаниеОповещения) Экспорт
	
	Если НЕ ОсновнойСерверДоступен() Тогда
		Сообщить("Основной сервер не доступен.");
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		Возврат;
	КонецЕсли;
	
	Результат = МТСД_ОбменДаннымиВызовОсновногоСервера.ЗарегистрироватьДанныеДляМТСД(ИмяПользователя(), ИмяМенеджераОбъекта, ПараметрыПолученияОбъекта);
	
	Контекст = Новый Структура;
	Контекст.Вставить("Результат", Результат);
	Контекст.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	ПолучитьОбъектНаМТСД_ОписаниеОповещения =  Новый ОписаниеОповещения("ПолучитьОбъектНаМТСДПослеОбменаДаннымиСОсновнымСервером", МТСД_ОбменДаннымиКлиент, Контекст);
	
	ВыполнитьОбмен(ПолучитьОбъектНаМТСД_ОписаниеОповещения);
	
КонецПроцедуры

Функция ВыполнитьОбмен(ОписаниеОповещения = Неопределено) Экспорт
	
	Если ОписанияОповещенияПослеОбменаДаннымиСОсновнымСервером = Неопределено Тогда
		ОписанияОповещенияПослеОбменаДаннымиСОсновнымСервером = Новый Массив;
	КонецЕсли;
	
	Если ОписаниеОповещения <> Неопределено Тогда
		ОписанияОповещенияПослеОбменаДаннымиСОсновнымСервером.Добавить(ОписаниеОповещения);
	КонецЕсли;
	
	ОбменДаннымиСОсновнымСервером.ВыполнитьОбмен(); // Почему то не доступен на автономном сервере.
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПолучитьОбъектНаМТСДПослеОбменаДаннымиСОсновнымСервером(Результат, Контекст) Экспорт
	
	ВыполнитьОбработкуОповещения(Контекст.ОписаниеОповещения, Контекст.Результат);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
