
&НаКлиенте
Процедура Фото(Команда)
	
	ДанныеМультимедиа = МТСД_ФотоВидеоКлиент.СделатьФото();
	
КонецПроцедуры

&НаКлиенте
Процедура Видео_ВысокоеКачество(Команда)
	
	ДанныеМультимедиа = МТСД_ФотоВидеоКлиент.СделатьВидео();	
	
КонецПроцедуры

&НаКлиенте
Процедура Видео_НизкоеКачество(Команда)
	#Если МобильныйКлиент Тогда
		
	НастройкиВидеозаписи = МТСД_ФотоВидеоКлиент.НовыеНастройкиВидеозаписи();
	НастройкиВидеозаписи.КачествоВидеозаписи = КачествоВидеозаписи.Низкое;
	
	ДанныеМультимедиа = МТСД_ФотоВидеоКлиент.СделатьВидео(НастройкиВидеозаписи);
	
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьГалерею(Команда)  
	
	#Если МобильныйКлиент Тогда 
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Каталог = КаталогБиблиотекиМобильногоУстройства(ТипКаталогаБиблиотекиМобильногоУстройства.Картинки);
	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;                  
		
    Картинка = Новый Картинка(ВыбранныеФайлы[0], Ложь);
	#КонецЕсли

КонецПроцедуры


