
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если НЕ МобильныйКлиент Тогда
		Элементы.СделатьФотоснимок.Видимость = Ложь;
		Элементы.СделатьВидеозапись.Видимость = Ложь;
	#Иначе
		Если ТолькоПросмотр = Ложь Тогда
			Элементы.СделатьФотоснимок.Доступность = СредстваМультимедиа.ПоддерживаетсяФотоснимок();            
			Элементы.СделатьВидеозапись.Доступность = СредстваМультимедиа.ПоддерживаетсяВидеозапись();
		Иначе
	       Элементы.СделатьФотоснимок.Доступность = Ложь;
		   Элементы.СделатьВидеозапись.Доступность = Ложь;
	    КонецЕсли;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлСДискаИЗаписать(Команда)

	ЗапуститьВыборФайлаСДискаИЗапись();

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗапуститьВыборФайлаСДискаИЗапись()

	Если Не ЗначениеЗаполнено(Объект.СсылкаНаВладельца) Тогда
		Ждать ПредупреждениеАсинх("Не заполнен владелец хранимого файла");
		Возврат;
	КонецЕсли;

	Попытка
		ОписаниеПомещенногоФайла = Ждать ПоместитьФайлНаСерверАсинх( , , , , УникальныйИдентификатор);
	Исключение
		Ждать ПредупреждениеАсинх("Ошибка помещения файла на сервер");
		Возврат;
	КонецПопытки;

	Если Не ОписаниеПомещенногоФайла = Неопределено Тогда
		НовыйОбъект = Объект.Ссылка.Пустая();

		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			#Если МобильныйКлиент Тогда
				Объект.Наименование = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолучитьПредставлениеФайлаБиблиотекиМобильногоУстройства();
			#Иначе
				ОписаниеФайла = Новый Файл(ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя);
				Объект.Наименование = ОписаниеФайла.Имя;
			#КонецЕсли
		КонецЕсли;

		ПоместитьФайлОбъекта(ОписаниеПомещенногоФайла.Адрес);

		Если НовыйОбъект Тогда
			ОтобразитьИзменениеДанных(Объект.Ссылка, ВидИзмененияДанных.Добавление);
		Иначе
			ОтобразитьИзменениеДанных(Объект.Ссылка, ВидИзмененияДанных.Изменение);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоместитьФайлОбъекта(АдресВременногоХранилища)

	ЭлементСправочника = РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ЭлементСправочника.ДанныеФайла = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных()); 

	ЭлементСправочника.Записать();

	Модифицированность = Ложь;
	УдалитьИзВременногоХранилища(АдресВременногоХранилища);
	ЗначениеВРеквизитФормы(ЭлементСправочника, "Объект");

КонецПроцедуры

#Если МобильныйКлиент Тогда 
&НаКлиенте
Процедура СделатьФотоснимок(Команда) 
	
	//ПоместитьМультимедиа(СделатьФото(Неопределено));
	
	ДанныеМультимедиа = МТСД_ФотоВидеоКлиент.СделатьФото();
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("jpg");
	ВременныйФайл = Новый Файл(ИмяВременногоФайла);
	
	ДанныеМультимедиа.ПолучитьДвоичныеДанные().Записать(ИмяВременногоФайла);
	
	КаталогБиблиотеки = КаталогБиблиотекиМобильногоУстройства(ТипКаталогаБиблиотекиМобильногоУстройства.Картинки);
	ПереместитьФайлАсинх(ИмяВременногоФайла, КаталогБиблиотеки);

КонецПроцедуры

&НаКлиенте
Процедура СделатьВидеозапись(Команда)

	//ДанныеМультимедиа = СредстваМультимедиа.СделатьВидеозапись(ТипКамерыУстройства.Авто,КачествоВидеозаписи.Высокое);
	//МТСД_ФотоВидеоКлиент.СделатьВидео();
	//ПоместитьМультимедиа();

КонецПроцедуры

&НаКлиенте
Процедура ПоместитьМультимедиа(ДанныеМультимедиа)

	Если ДанныеМультимедиа <> Неопределено Тогда
		НовыйОбъект = Объект.Ссылка.Пустая();
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДанныеМультимедиа.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		
		ТипСодержимого = ДанныеМультимедиа.ТипСодержимого;
		Номер = Найти(ТипСодержимого, "/");

		Если Номер > 0 Тогда
			ТипСодержимого = Лев(ТипСодержимого, Номер - 1);
		КонецЕсли;
		Объект.Наименование = СтрЗаменить(Строка(ТекущаяДата()), ":", "_");
		Объект.Расширение = ДанныеМультимедиа.РасширениеФайла;	 

		ПоместитьФайлОбъекта(АдресВременногоХранилища);

		Если НовыйОбъект Тогда
			ОтобразитьИзменениеДанных(Объект.Ссылка, ВидИзмененияДанных.Добавление);
		Иначе
			ОтобразитьИзменениеДанных(Объект.Ссылка, ВидИзмененияДанных.Изменение);
		КонецЕсли;
	КонецЕсли; 
	
	//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	//Диалог.ПолноеИмяФайла = Объект.Наименование;
	//Диалог.Фильтр = "Файл изображения(*.png,*.jpg)|*.png;*.jpg";
	//Диалог.Расширение = "png,jpg";
	//Диалог.МножественныйВыбор = Ложь;
	
	//ДанныеМультимедиа.Записать(Диалог.ПолноеИмяФайла,);    
		
КонецПроцедуры
#КонецЕсли
                                                                                  
&НаКлиенте
Процедура ОткрытьФайл(Команда)

	ХранимыйФайл = Объект;
	ВыполнитьОткрытьФайл(ХранимыйФайл);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьОткрытьФайл(ХранимыйФайл);

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(ХранимыйФайл.Расширение);
	Адрес = ПолучитьНавигационнуюСсылку(ХранимыйФайл.Ссылка, "ДанныеФайла");

	Попытка
		ПолученныеФайлы = Ждать ПолучитьФайлССервераАсинх(Адрес, ИмяВременногоФайла);
	Исключение
		Ждать ПредупреждениеАсинх("Ошибка получения файла " + ИмяВременногоФайла + "с сервера");
	Возврат;
	КонецПопытки;

	ЗапуститьПриложениеАсинх(ИмяВременногоФайла);
	
КонецПроцедуры

