
#Если НЕ АвтономныйСервер Тогда

#Область ПрограммныйИнтерфейс

Процедура ПодготовитьФайлБСПКПередачеНаМТСД(ФайлБСП, УзелМТСД, ВладелецФайлаНаМТСД = Неопределено)
	
	ГУИД = XMLСтрока(ФайлБСП);
	УникальныйИдентификатор = Новый УникальныйИдентификатор(ГУИД);
	ФайлНаМТСД = Справочники.МТСД_ХранимыеФайлы.ПолучитьСсылку(УникальныйИдентификатор);
	ФайлНаМТСДОбъект = ФайлНаМТСД.ПолучитьОбъект();
	Если ФайлНаМТСДОбъект = Неопределено Тогда
		ФайлНаМТСДОбъект = Справочники.МТСД_ХранимыеФайлы.СоздатьЭлемент();
		ФайлНаМТСДОбъект.УстановитьСсылкуНового(ФайлНаМТСД);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ФайлНаМТСДОбъект, ФайлБСП);
	
	Если ВладелецФайлаНаМТСД <> Неопределено Тогда
		ФайлНаМТСДОбъект.ВладелецФайла = ВладелецФайлаНаМТСД;
	КонецЕсли;
		
	// TODO перенести двоичные данные файла из БСП
	
	ФайлНаМТСДОбъект.ОбменДанными.Получатели.Добавить(УзелМТСД);
	ФайлНаМТСДОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьПостОбработкуПослеПолученияДанныхОтМТСД(Объект, ТекстОшибки, ВыполнятьПовторнуюОбработкуПослеОшибки) Экспорт
	
	// TODO Переписать файлы в справочники БСП
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли