
#Если МобильныйКлиент Тогда
Перем ОписанияОповещенияПослеОбменаДаннымиСОсновнымСервером Экспорт;
#КонецЕсли

#Если МобильныйКлиент Тогда
Процедура ПослеОбменаДаннымиСОсновнымСервером(ВключеноОповещениеОСинхронизации, СтандартнаяОбработка, ДатаОбмена)
	
	Если ЗначениеЗаполнено(ОписанияОповещенияПослеОбменаДаннымиСОсновнымСервером) Тогда
		Для Каждого ОписаниеОповещения Из ОписанияОповещенияПослеОбменаДаннымиСОсновнымСервером Цикл
			ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		КонецЦикла;
		
		ОписанияОповещенияПослеОбменаДаннымиСОсновнымСервером.Очистить();
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли
