
#Если АвтономныйСервер Тогда

Процедура ДобавитьДанные(Объект, ИмяДанных = "ОсновныеДанные", Данные) Экспорт
	
	УзелМТСД = ПланыОбмена.МТСД.ЦентральныйУзел();
	ДобавитьДанные_ЛюбойСервер(Объект, ИмяДанных, Данные, УзелМТСД);
	
КонецПроцедуры

#Иначе

Процедура ДобавитьДанные(Объект, ИмяДанных = "ОсновныеДанные", Данные, УзелМТСД) Экспорт
	
	ДобавитьДанные_ЛюбойСервер(Объект, ИмяДанных, Данные, УзелМТСД);
	
КонецПроцедуры

#КонецЕсли

#Область СлужебныеПроцедурыФункции

Процедура ДобавитьДанные_ЛюбойСервер(Объект, ИмяДанных, Данные, УзелМТСД)
	
	НаборЗаписей = РегистрыСведений.МТСД_ДанныеОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.ИмяДанных.Установить(ИмяДанных);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = Объект;
	НоваяЗапись.ИмяДанных = ИмяДанных;
	НоваяЗапись.Данные = Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
	
	НаборЗаписей.ОбменДанными.Получатели.Добавить(УзелМТСД);
	
КонецПроцедуры

#КонецОбласти