
#Если МобильныйКлиент Тогда

#Область ПрограммныйИнтерфейс

// Сканировать штрихкоды
//
// Параметры:
//  ОповещениеСканирования	 - ОписаниеОповещения	 - См. СредстваМультимедиа.ПоказатьСканированиеШтрихКодов
//  ОбработчикЗакрытия	 	 - ОписаниеОповещения	 - См. СредстваМультимедиа.ПоказатьСканированиеШтрихКодов
//  Заголовок				 - Строка - заголовок окна сканирования штрихкода.
//  ДопустимыйТипШтрихКода	 - ТипШтрихКода
//
Процедура СканироватьШтрихкоды(ОповещениеСканирования, ОбработчикЗакрытия = Неопределено, Заголовок = "", ДопустимыйТипШтрихКода = Неопределено) Экспорт       
	
	Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда 
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканирование", ОповещениеСканирования, ОбработчикЗакрытия, ДопустимыйТипШтрихКода);
	Иначе                                          
		Сообщение = Новый СообщениеПользователю();    
		Сообщение.Текст = "Сканирование не поддерживается";
		Сообщение.Сообщить();
		ВыполнитьОбработкуОповещения(ОповещениеСканирования, Неопределено);
	КонецЕсли;		           
	
КонецПроцедуры

// После сканирования одного штрихкода
//
// Параметры:
//  Результат - Булево - "Результат" полученный при обработке "ОповещениеСканирования"
//  Сообщение - Строка - "Сообщение" полученный при обработке "ОповещениеСканирования". Если был просканирован не правильный штрихкод и требуется продолжить сканирование, то в сообщении должен быть текст ошикби.
//
Процедура ПослеСканированияОдногоШтрихкода(Результат, Сообщение) Экспорт
	
	Если ЗначениеЗаполнено(Сообщение) Тогда
		Результат = Ложь;
	Иначе	
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
