
&НаКлиенте
Асинх Процедура ПолучитьДокумент(Команда)
	
	НомерДокумента = ?(Элементы.Список.ТекущиеДанные <> Неопределено, Элементы.Список.ТекущиеДанные.Номер, "");
	НомерДокумента = Ждать ВвестиСтрокуАсинх(НомерДокумента, "Введите номер документа", 9);
	
	ПараметрыПолученияОбъекта = Новый Структура("НомерДокумента", НомерДокумента);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьДокументПослеОбменаДанными", ЭтаФорма);
	МТСД_ОбменДаннымиКлиент.ПолучитьОбъектНаМТСД("Документы.WA_ЧекЛист", ПараметрыПолученияОбъекта, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументПослеОбменаДанными(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат.Ссылка) Тогда
		Элементы.Список.Обновить();
		ОткрытьЗначение(Результат.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
