
Процедура ПриАвтоматическомСозданииНовогоУзла(Отказ)
	
	// Выполнить инициализацию нового узла (если требуется)
	
КонецПроцедуры

Процедура ПередСозданиемНачальногоОбраза(ТолькоЗарегистрированные, ПотокОбменаДанными)
	
	ТолькоЗарегистрированные = Истина;
	
	Для Каждого Элемент Из Метаданные.ПланыОбмена.МТСД.Состав Цикл
		Если Элемент.АвтоРегистрация = АвтоРегистрацияИзменений.Разрешить Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Ссылка, Элемент.Метаданные);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	ЭлементДанных.ДополнительныеСвойства.Вставить("ДанныеПолученыОтМТСД", Истина);
	ЭлементДанных.ДополнительныеСвойства.Вставить("УзелМТСД", Ссылка);
	
	// TODO Реализовать разрешение коллизий.
	ПолучениеЭлемента = ПолучениеЭлементаДанных.Принять;
	
КонецПроцедуры


